# Mock Belt Exam (Practice)
Jude Maico Jr.

- You will NOT have to make API calls on the exam
- Instead, you WILL be given a .json file that simulates the results of making API calls

<b> Task
Your task is to use your data science skills to help the Kiva crowdfunding organization process and analyze their internal API data on customer sales. They want you to do 2 things for them. 
    
1) Convert their internal API results into a MySQL Database and 
    
2) formally answer the following question using hypothesis testing: 

    - “Is there is a significant difference between the funded amount when it is all males and when there is at least one female in the group?“


<b> Make sure you:

##  Extract: 

- Work in a Jupyter notebook using the dojo-env within a PRIVATE github repo.
- Please your name your repo using the following format: "First-Last__Mock-Exam" (Please make sure you use two underscores after your name)
- Explore the .json file in your Jupyter notebook to find the results from previously made API calls.
- Separate the 4 sets of records within the ‘data’ master key into 4 pandas dataframes for processing.

In [1]:
import json
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
# loading json file
with open('Mock_Crowdsourcing_API_Results.json') as f:
    file = json.load(f)
file.keys()

dict_keys(['meta', 'data'])

In [3]:
# looking at what file contains
file['data'].keys()

dict_keys(['crowd', 'demographics', 'financials', 'use'])

### Crowd DF

In [4]:
crowd = pd.DataFrame(file['data']['crowd'])
crowd.head(3)

        id                posted_time                funded_time  lender_count
0   658776  2014-01-17 21:21:10+00:00  2014-02-05 17:57:55+00:00            33
1  1314847  2017-06-07 02:02:41+00:00  2017-06-21 17:10:38+00:00             9
2   863063  2015-03-27 20:08:04+00:00  2015-04-04 15:01:22+00:00             1

###  Demographics DF

In [5]:
demographics = pd.DataFrame(file['data']['demographics'])
demographics.head(3)

,id,country,region,borrower_genders
0,658776,El Salvador,Ciudad El Triunfo,male
1,1314847,Philippines,"Bais, Negros Oriental",female
2,863063,Peru,Huarochiri,"female, female, female, female, female, female..."

### Financials DF

In [6]:
financials = pd.DataFrame(file['data']['financials'])
financials.head(3)

        id funded_amount currency  term_in_months
0   658776       $1000.0      USD            20.0
1  1314847        $225.0      PHP            13.0
2   863063       $1150.0      PEN             6.0

### Use DF

In [7]:
use = pd.DataFrame(file['data']['use'])
use.head(3)

,id,activity,sector,use
0,658776,Vehicle,Personal Use,to purchase a motorcycle in order to travel fr...
1,1314847,Pigs,Agriculture,to buy feed and other supplies like vitamins t...
2,863063,Bookstore,Retail,"to buy notebooks, pencils, and pens."

## Transform:

- In the financials data:
    - remove ‘$’ from funded_amount and change to numeric
- You do NOT need to normalize the tables/database.
- You do NOT need to do any other preprocessing/cleaning on the other tables.

In [8]:
financials.info()
financials.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              10000 non-null  int64
 1   funded_amount   10000 non-null  object
 2   currency        10000 non-null  object
 3   term_in_months  10000 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 312.6+ KB

        id funded_amount currency  term_in_months
0   658776       $1000.0      USD            20.0
1  1314847        $225.0      PHP            13.0
2   863063       $1150.0      PEN             6.0

In [9]:
financials['funded_amount'] = financials['funded_amount'].str.replace('$','', regex = True).astype(float)
financials.head(3)

        id  funded_amount currency  term_in_months
0   658776         1000.0      USD            20.0
1  1314847          225.0      PHP            13.0
2   863063         1150.0      PEN             6.0

## Load:

- Use SQL alchemy in Python to convert this information into a MySQL database in your Jupyter notebook.
- Create a new MySQL database called Mock_Exam using SQLAlchemy_utils 
- Upload each of the four dataframes as separate tables into this database using SQLAlchemy
- Perform a SQL query in your notebook to “SHOW TABLES;” for your newly created database. 
- Open your database in MySQL workbench and export it to a .sql file in your repository with your notebook.

In [10]:
connection = 'mysql+pymysql://root:DataRespT1229@localhost/mock_belt'
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/mock_belt)

In [11]:
# check if db exists
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print("The database created!")

It exists!

In [46]:
# dataframes to database
crowd.to_sql('crowd', engine, index = False, if_exists = 'replace')
demographics.to_sql('demographics', engine, index = False, if_exists = 'replace')
financials.to_sql('financials', engine, index = False, if_exists = 'replace')
use.to_sql('use', engine, index = False, if_exists = 'replace')

10000

In [47]:
use_query = '''SHOW TABLES'''
pd.read_sql(use_query, engine)

  Tables_in_mock_belt
0               crowd
1        demographics
2          financials
3                 use

## Hypothesis Test:
<i> “Is there is a significant difference between the funded amount when it is all males and when there is at least one female in the group?“

- Use information from the dataframes or database (your choice) to test the stakeholder’s hypothesis 
- State the null and alternative hypotheses.
- Use a significance level of alpha = 0.05
- Separate the data into two groups (“all_male" and "at_least_one_female" 
- Choose the appropriate hypothesis test based on the data.
- Check and address the assumptions for the test.
    - Summarize your observations in a markdown cell. 
- Perform the correct test and get your p-value.
- Interpret the p-value of your results and state whether you  can “reject” or “fail to reject” the null hypothesis.
- Summarize your results:
    - Write a simple statement to explain the results of your test to a non-technical stakeholder.  
    - Include a visualization showing the comparison you are testing.

## Final Deliverables: 

- Add your .sql file and your .ipynb file to a PRIVATE github repository.
    - Please make sure your name has the following format: "First-Last__Mock-Exam" (Please make sure you use two underscores after your name).
- Download your final repository as a zip file on github.com (not from Github Desktop):